{
  "pageProps": {
    "postData": {
      "title": "Microeconomics",
      "markdownContentSource": "\n# Supply, demand, and market equilibrium\n\n## Introduction to economics\n\nHe being an economic actor, neither intends to promote the public interest, nor knows how much he is promoting it. By directing that industry, so that the industry in control of that individual actor in such a manner, as its produce may be of the greatest value. **He intends only his own gain**. And he led by an invisible hand to promote an end which was no part of his intention. By pursuing his own interest he frequently promotes that of the society more effectually than when he really intends to promote it. - Adam Smith 1776\n\nThis is the foundational ideas of capitalism. In competition, individual ambition serves the common good. The self-interested action could often lead to promote public interest.\n\nThe microeconomic is that people, individual actors are acting out of their own self-interest and the macroeconomic is that it might be good for the economy or for the nation as a whole. Microeconomis is essentially how actors make decisions of scarce resources and how does that affect prices and markets. Macroeconomis is the study of what happens at the aggregate to an economy from the millions of individual actors, and often focuses on policy-related questions. How does that affect the overall productivity when you do this policy.\n\n## Law of demand\n\nThe **law of demand** states that a higger price to a lower quantit demanded and that lower price leads to a higher quantity demanded. **Demand curves** and **demand schedules** are tools used to summarize the relationship between quantity demandded and price.\n\n### Demand for goods and services\n\nEconomists use the term **demand** to refer to the amount of some good or service consumers are willing and able to purchase at each price. Demand is based on needs and wants a consumer may be able to diferentiate between a need and a want, but from an economist's perspective they are the same thing. What a buyer pays for a unit of the specific good or service is called **price**. The total number of units purchased at that price is called the **quantity demanded**. A rise in price of a good or service almost always **decreases the quantity demanded**. Conversely, a fall in price will **increase the quantity demanded**. Econimists call this inverse relationship between price and quantity demanded the **law of demand**. The **law of demand** assumes that all other variables that affect demand are held constant.\n\n### Demand schedule  and demand curve\n\n* A demand schedule is a table that shows the quantity demanded at each price.\n* A demand curve is a graph that shows the quantity demanded at each price.\n\n### The difference between demand and quantity demanded\n\nThe demand mean the relationship between a range of prices and the quantities demanded at those prices. When economists talk about quantity demanded, they mean only a certain point on the demand.\n\n# Reference\n\n1. [Supply Demand Equilibrium](https://www.khanacademy.org/economics-finance-domain/microeconomics/supply-demand-equilibrium)",
      "slug": "Microeconomics",
      "date": "2019-01-31 22:53:35",
      "lang": "en",
      "tags": ["Microeconomics"],
      "path": "/Microeconomics/index.html"
    },
    "lang": "en",
    "_nextI18Next": {
      "initialI18nStore": {
        "en": {
          "common": { "Next": "Next" },
          "feature-tags": { "Tags": "Tags" },
          "navbar": {
            "Home": "Home",
            "Language": "Language",
            "Tags": "Tags",
            "en": "English",
            "es": "Spanish",
            "zh": "Chinese"
          },
          "post-layout": { "Author": "Author: {{author}}" }
        }
      },
      "initialLocale": "en",
      "ns": ["common", "feature-tags", "navbar", "post-layout"],
      "userConfig": {
        "i18n": { "defaultLocale": "en", "locales": ["en", "es", "zh"] },
        "default": {
          "i18n": { "defaultLocale": "en", "locales": ["en", "es", "zh"] }
        }
      }
    }
  },
  "__N_SSG": true
}
