{
  "pageProps": {
    "postData": {
      "title": "Vector Database",
      "markdownContentSource": "\nA vector database indexes and stores vector embeddings for fast retrieval and similarity search, with capabilities like CRUD operations. Vector embeddings are generated by large language models.\n\n![vector database](vector-database.webp)\n\n1. Use the embedding model to create vector embeddings for the content we want to index.\n1. The vector embedding is inserted into the vector database, with some reference to the original content the embedding was created from.\n1. When the application issues a query, use the same embedding model to create embeddings for the query and use those embeddings to query the database for similar vector embeddings.\n1. Tracking back the original content associated with most similar vector embeddings.\n\n![pipeline](pipeline.webp)\n\n1. Indexing: The vector database create indexes for vector embedding using an algorithm such as Random Projection, Product Quantization, Locality-sensitive hashing, or Hierarchical Navigable Small World (more on these below). This step maps the vector embedding to a data structure that will enable faster searching.\n1. Querying: The vector database compute the index of query vector to find the approximated nearest neighbors vector embedding applying a similarity metric.\n1. Post Processing: The vector database retrieves the final nearest neighbors from the dataset and compute the similarity and re-ranking the nearest neighbors vector embedding.\n\nIn vector databases, a similarity metric is applied to rank a vector that is the most similar to query vector, there is different similarity measure. The basic rule of thumb in selecting the best similarity metric is to match it to the one used to train the embedding model, which is usually the dot product.\n\n## Reference\n\n* https://www.pinecone.io/learn/vector-database/\n* https://www.pinecone.io/learn/vector-similarity/\n* https://www.pinecone.io/learn/series/faiss/",
      "slug": "vector-database",
      "date": "2024-09-29 19:19:40",
      "lang": "en",
      "tags": ["vector database"],
      "path": "/vector-database/index.html"
    },
    "lang": "en",
    "_nextI18Next": {
      "initialI18nStore": {
        "en": {
          "common": { "Next": "Next" },
          "feature-tags": {},
          "navbar": {
            "Home": "Home",
            "Language": "Language",
            "Tags": "Tags",
            "en": "English",
            "es": "Spanish",
            "zh": "Chinese"
          },
          "post-layout": { "Author": "Author: {{author}}", "Tags": "Tags" }
        }
      },
      "initialLocale": "en",
      "ns": ["common", "feature-tags", "navbar", "post-layout"],
      "userConfig": {
        "i18n": { "defaultLocale": "en", "locales": ["en", "es", "zh"] },
        "default": {
          "i18n": { "defaultLocale": "en", "locales": ["en", "es", "zh"] }
        }
      }
    }
  },
  "__N_SSG": true
}
